NextFOAM-24/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0.orig/filmRegion/Tf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Tf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  298;

boundaryField
{
    region0_to_filmRegion_coupledWall // Patch to pyrolysis
    {
        type            mappedField;
        sampleRegion    pyrolysisRegion;
        sampleMode      nearestPatchFace;
        samplePatch     region0_to_pyrolysisRegion_coupledWall;
        offset          (0 0 0);
        field       T;
        setAverage      no;
        average         0;
        value           uniform 298;
    }

    coupledWall_top // Patch to Region0
    {
        type            zeroGradient;
    }

    "side.*"
    {
        type            inletOutlet;
        inletValue      uniform 298;
        value           uniform 298;
    }

    outlet
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 298.0;
    }
}


// ************************************************************************* //
